In [17]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model

In [13]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Henry', 'Ivy', 'Jack'],
    'Age': [25, 30, 35, 28, 32, 27, 31, 29, 34, 26],
    'Qualification': ['Bachelor', 'Master', 'PhD', 'Master', 'Bachelor', 'Master', 'PhD', 'Bachelor', 'Master', 'PhD'],
    'Gender': ['Female', 'Male', 'Male', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male'],
    'City': ['New York', 'London', 'Tokyo', 'Paris', 'Berlin', 'Sydney', 'Toronto', 'Mumbai', 'Singapore', 'Dubai'],
    'Country': ['USA', 'UK', 'Japan', 'France', 'Germany', 'Australia', 'Canada', 'India', 'Singapore', 'UAE']
}

df = pd.DataFrame(data)

In [15]:
df

      Name  Age Qualification  Gender       City    Country
0    Alice   25      Bachelor  Female   New York        USA
1      Bob   30        Master    Male     London         UK
2  Charlie   35           PhD    Male      Tokyo      Japan
3    David   28        Master    Male      Paris     France
4      Eva   32      Bachelor  Female     Berlin    Germany
5    Frank   27        Master    Male     Sydney  Australia
6    Grace   31           PhD  Female    Toronto     Canada
7    Henry   29      Bachelor    Male     Mumbai      India
8      Ivy   34        Master  Female  Singapore  Singapore
9     Jack   26           PhD    Male      Dubai        UAE

In [25]:
df.Age.median()

29.5

In [27]:
import math
median_Age=math.floor(df.Age.median())
median_Age

29

In [29]:
df.Age = df.Age.fillna(median_Age)
df

      Name  Age Qualification  Gender       City    Country
0    Alice   25      Bachelor  Female   New York        USA
1      Bob   30        Master    Male     London         UK
2  Charlie   35           PhD    Male      Tokyo      Japan
3    David   28        Master    Male      Paris     France
4      Eva   32      Bachelor  Female     Berlin    Germany
5    Frank   27        Master    Male     Sydney  Australia
6    Grace   31           PhD  Female    Toronto     Canada
7    Henry   29      Bachelor    Male     Mumbai      India
8      Ivy   34        Master  Female  Singapore  Singapore
9     Jack   26           PhD    Male      Dubai        UAE

In [31]:
reg = linear_model.LinearRegression()
reg.fit(df[['Age',	'Qualification','Gender',	'City',	'Country']],df.job)

AttributeError: 'DataFrame' object has no attribute 'job'